---
kind: type
id: T:Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
source: html/7d3fba7a-5efb-6a4c-a49c-16c25f972830.htm
---
# Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs

The base class used for post events where the arguments must supply access to the document.

## Syntax (C#)
```csharp
public class RevitAPIPostDocEventArgs : RevitAPIPostEventArgs
```